IdeaRS.OpenModel.Model.Element2D
Representation of element2D

IdeaRS.OpenModel.Model.Element2D.#ctor
Constructor

IdeaRS.OpenModel.Model.Element2D.Material
Material

IdeaRS.OpenModel.Model.Element2D.GeometricRegion
Geometry region of element2D

IdeaRS.OpenModel.Model.Element2D.Thickness
Thicknes of Element2D

IdeaRS.OpenModel.Model.Element2D.EccentricityZ
Displacement in local axis Z

IdeaRS.OpenModel.Model.Element2D.InnerLines
Inner lines of this region

IdeaRS.OpenModel.Model.Element2D.InnerPoints
Inner points of this region

IdeaRS.OpenModel.Model.Element2D.ElementType
Analysis type - shell, plate, wall